app/controllers/api/blogs_controller.rb

SELECT "blogs".* FROM "blogs" WHERE ("blogs"."user_id" != $1)  [["user_id", 15]]
---
	def index
		@blogs = Blog.most_popular.where.not(user_id: current_user.id)

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT 1  [["id", 4]]
SELECT "posts".* FROM "posts" WHERE "posts"."blog_id" IN (4)
---
	def show
		@blog = Blog.includes(:posts).find(params[:id])