app/controllers/api/comments_controller.rb

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 4]]
---
	def show
    @comment = Comment.find_by_id(params[:id])