app/controllers/api/followings_controller.rb

  def create
		Following.transaction do
			@follow = current_user.followings.build(
				blog_id: params[:blog_id])

			@author = Blog.joins(:user).find(params[:blog_id]).user
		end

    if @follow.save && create_with_notification(@author)
---
INSERT INTO "followings" ("blog_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["blog_id", 4], ["user_id", 15], ["created_at", "2015-01-09 22:32:27.001454"], ["updated_at", "2015-01-09 22:32:27.001454"]]

  def destroy
		@follow = current_user.followings.find_by(blog_id: params[:blog_id])
    @follow.destroy!
---
SELECT  "followings".* FROM "followings" WHERE "followings"."user_id" = $1 AND "followings"."blog_id" = $2 LIMIT 1  [["user_id", 15], ["blog_id", 0]]
DELETE FROM "followings" WHERE "followings"."id" = $1  [["id", 14]]