app/controllers/api/posts_controller.rb

	def create
		@blog = Blog.find(post_params[:blog_id])
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT 1  [["id", 4]]