app/controllers/api/taggings_controller.rb

	def index
		if params[:blog_id]
			@blog = Blog.find(params[:blog_id])
			render json: @blog.as_json(methods: :tags)
		elsif params[:post_id]
			@post = Post.find(params[:post_id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 23]]

	def show
		@tagging = Tagging.find(params[:id])
---
SELECT  "taggings".* FROM "taggings" WHERE "taggings"."id" = $1 LIMIT 1  [["id", 1]]