app/controllers/api/users_controller.rb

  def create
		User.transaction do
			@user = User.new(user_params)
			@user.create_dashboard
---
INSERT INTO "dashboards" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 14], ["created_at", "2015-01-07 22:59:47.980069"], ["updated_at", "2015-01-07 22:59:47.980069"]]
INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

	def update
		if user_params[:old_password]
			@user = User.find_by_credentials(current_user.email, user_params[:old_password])
		else
			@user = current_user
		end

		if @user && @user == current_user
			@user.update(user_params.except(:old_password))
---
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "$2a$10$Xh/orsp5/Z1BccSWLvCPteBMd3ysnsMGpEgtD.w25y9ns4Oe6hADO"], ["updated_at", "2015-01-09 15:17:11.672622"], ["id", 12]]