app/views/blogs/show.html.erb


	<% @blog.posts.each do |p| %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."blog_id" IN (7)