app/views/api/posts/comments.json.jbuilder

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 23]]
---
json.array! @post.comments.includes(:child_comments), partial: 'api/comments/comment', as: :comment