app/views/posts/comments.json.jbuilder

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 17]]
---
json.array! @post.comments.includes(:child_comments), partial: 'comments/comment', as: :comment