app/controllers/blogs_controller.rb

SELECT "blogs".* FROM "blogs" WHERE ("blogs"."user_id" != $1)  [["user_id", 4]]
---
	def index # GET /explore/blogs
		@blogs = Blog.where.not(user_id: current_user.id)

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."blog_id" IN (1)
---
	def show
		@blog = Blog.includes(:posts).find(params[:id])

INSERT INTO "blogs" ("avatar_url", "name", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
	def create
		@blog = current_user.blogs.build(blog_params)
		if @blog.save