app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "post_id", "parent_comment_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["body", "making the first child reply"], ["post_id", 17], ["parent_comment_id", 5], ["user_id", 16], ["created_at", "2015-01-08 23:12:17.430331"], ["updated_at", "2015-01-08 23:12:17.430331"]]
---
  def create
    @comment = current_user.comments.new(comment_params)

    if @comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 1]]
---
	def show
    @comment = Comment.find_by_id(params[:id])