app/controllers/followings_controller.rb

  def create

		@follow = current_user.followings.create!(blog_id: params[:blog_id])
---
INSERT INTO "followings" ("blog_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["blog_id", 1], ["user_id", 3], ["created_at", "2015-01-07 20:18:19.150485"], ["updated_at", "2015-01-07 20:18:19.150485"]]

  def destroy

		@follow = current_user.followings.find_by(blog_id: params[:blog_id])
    @follow.destroy!
---
SELECT  "followings".* FROM "followings" WHERE "followings"."user_id" = $1 AND "followings"."blog_id" = $2 LIMIT 1  [["user_id", 13], ["blog_id", 4]]
DELETE FROM "followings" WHERE "followings"."id" = $1  [["id", 2]]