app/controllers/likes_controller.rb

	def create
		@like = current_user.likings.build(
			likeable_type: params[:likeable_type],
			likeable_id: params[:likeable_id])

		if @like.save
---
INSERT INTO "likes" ("likeable_type", "likeable_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["likeable_type", "Post"], ["likeable_id", 4], ["user_id", 12], ["created_at", "2015-01-08 03:15:27.795845"], ["updated_at", "2015-01-08 03:15:27.795845"]]

	def destroy
		@like = Like.find_by(likeable_type: params[:likeable_type], likeable_id: params[:likeable_id])
		@like.destroy!
---
SELECT  "likes".* FROM "likes" WHERE "likes"."likeable_type" = $1 AND "likes"."likeable_id" = $2 LIMIT 1  [["likeable_type", "Post"], ["likeable_id", 4]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 1]]