app/controllers/posts_controller.rb

	def create
		blog = Blog.find(post_params[:blog_id])

		@post = blog.posts.build(post_params)
		if @post.save
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT 1  [["id", 5]]
INSERT INTO "posts" ("blog_id", "content", "filepicker_urls", "reblogged", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"